tutorials/CFD/21unsteadyNSTurb_RBF/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
11644
(
(1.00126 -0.000928663 0)
(1.00126 -0.00278235 0)
(1.00125 -0.00462434 0)
(1.00123 -0.00644417 0)
(1.0012 -0.00822735 0)
(1.00115 -0.00995369 0)
(1.00108 -0.0115956 0)
(1.00099 -0.0131163 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            slip;
    }
    cylinder1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
